# Taps
tap "koekeishiya/formulae"

# Mac App Store
mas "Pandan", id: 1569600264
mas "Lungo", id: 1263070803

# Apps
cask "brave-browser"
cask "firefox"
cask "flux"
cask "ghostty"
cask "google-chrome"
cask "istat-menus"
cask "karabiner-elements"
cask "little-snitch"
cask "visual-studio-code"
cask "font-jetbrains-mono-nerd-font"

# CLI tools
brew "mas"
brew "gh"
brew "httpie"
brew "jq"
brew "neovim"
brew "ripgrep"
brew "tmux"
brew "wallpaper"

# Window management
brew "skhd"
brew "yabai"

# Node / JS
brew "node@22"
brew "pnpm"

# Shell
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"
brew "pure"
